# -*- coding: utf-8 -*-

import re
import time
from copy import deepcopy

from config import (
     IsDebug, IsDeepDebug, IsTrace, IsPrintExceptions, IsWithPrintErrors, IsWithGroup, IsWithExtra, 
     errorlog, print_to, print_exception,
    )

from app.settings import DEFAULT_LANGUAGE, DEFAULT_PARSE_MODE, NO_RESULTS, NO_KEY, RCODES
from app.dialogs.start import help
from app.handlers import *

from app import dbs

# Группировка результатов
_with_group = IsWithGroup
# Ответ "Не знаю"
_with_extra = IsWithExtra

# --------------------------------------------------
# Индивидуально-типологический опросник Собчик (ИТО)
# --------------------------------------------------

_TEST_NAME = 'T2'
_QCOUNT = 91
_QCOUNT_EXT = 61

_QUESTIONS = {
    'ru': (
"""
1. Я постараюсь отнестись к исследованию ответственно и быть максимально искренним (искренней)
""",
"""
2. У меня очень сложный и трудный для окружающих характер
""",
"""
3. Я лучше справляюсь с работой в тиши и одиночестве, чем в присутствии многих людей или в шумном месте
""",
"""
4. Решая серьезные проблемы, я, как правило, обхожусь без посторонней помощи
""",
"""
5. Я очень редко заговариваю первым (первой) с незнакомыми людьми
""",
"""
6. Для меня важно, что подумают другие о моих высказываниях и поступках
""",
"""
7. Если будет нужно, я разрушу все преграды на пути к достижению цели
""",
"""
8. Я часто тревожусь по пустякам
""",
"""
9. В моих неудачах виноваты определенные люди
""",
"""
10. Для меня важно иметь общее мнение с теми людьми, с которыми я обычно общаюсь
""",
"""
11. Меня мало касается все, что случается с другими
""",
"""
12. Мне интересны яркие, артистичные личности
""",
"""
13. Мне нет дела до чужих страданий: хватает своих
""",
"""
14. В шумной компании я чаще всего в роли только наблюдателя
""",
"""
15. Для меня невыносимо наблюдать страдания других людей
""",
"""
16. Я человек абсолютно правдивый и искренний
""",
"""
17. Все мои беды связаны с собственным неумением ладить с людьми
""",
"""
18. Меня часто тянет к шумным компаниям
""",
"""
19. Принимая важное решение, я всегда действую самостоятельно
""",
"""
20. Мне всегда приятно заводить новых знакомых
""",
"""
21. Берясь за какое-либо дело, я не стану долго раздумывать, прежде чем начать действовать
""",
"""
22. Меня раздражают люди, пытающиеся изменить мое мнение, когда я уверен(а) в своей правоте
""",
"""
23. Я часто волнуюсь за близких мне людей даже без серьезного повода
""",
"""
24. Я не могу терпеть, когда кто-нибудь меняет заведенный мной порядок
""",
"""
25. Я умею привлекать к себе внимание окружающих меня людей
""",
"""
26. В жизни я твердо придерживаюсь определенных принципов
""",
"""
27. Люблю посещать компании, где можно танцевать или петь
""",
"""
28. Я чрезвычайно чувствителен (чувствительна) к изменениям в настроении окружающих меня людей
""",
"""
29. Я могу, не смущаясь, дурачиться в веселой компании
""",
"""
30. Я спокойно отношусь к тому, что кто-то рядом переживает по поводу своих неприятностей
""",
"""
31. Я никогда не поступаю как эгоист (эгоистка)
""",
"""
32. Часто бывает так, что из-за меня у окружающих портится настроение
""",
"""
33. Интересные идеи приходят мне в голову чаще, когда я один (одна), не в присутствии многих людей
""",
"""
34. Я могу взять на себя ответственность за целую группу людей для пользы дела
""",
"""
35. Мне трудно преодолеть застенчивость, когда нужно говорить перед группой людей
""",
"""
36. Мнение старших по возрасту или положению большого значения для меня не имеет
""",
"""
37. Мне не трудно заставить других людей действовать так, как я считаю нужным
""",
"""
38. Я так сильно переживаю неудачи, что у меня ухудшается самочувствие
""",
"""
39. Я всегда бываю упрям(а) в тех случаях, когда уверен(а) в своей правоте
""",
"""
40. Если в компании я не нахожусь в центре внимания, мне становится скучно и неинтересно
""",
"""
41. Никто не может навязать мне свое мнение
""",
"""
42. Мне нравится путешествовать с разными, каждый раз новыми попутчиками
""",
"""
43. Я могу изменить свое мнение под давлением окружающих
""",
"""
44. В поезде я с удовольствием провожу время в беседе с соседями по купе
""",
"""
45. Я никогда не вру
""",
"""
46. Я никогда не откладываю на завтра то, что следует сделать сегодня
""",
"""
47. Я вечно ничем недоволен (недовольна)
""",
"""
48. Я люблю одиночество, позволяющее мне сосредоточиться на своих мыслях
""",
"""
49. Я умею заинтересовать людей и повести их за собой
""",
"""
50. Мне нравится командовать другими
""",
"""
51. Я умею дать отпор тем, кто вмешивается в мои дела
""",
"""
52. Мне бывает неловко за высказывания и поступки моих близких
""",
"""
53. Мне нередко приходилось в драке защищать свои права
""",
"""
54. Я испытываю чувство вины (или даже стыда), если меня преследуют неудачи
""",
"""
55. Мое настроение находится в сильной зависимости от настроя тех, кто меня окружает
""",
"""
56. Я добиваюсь своего упорством и настойчивостью
""",
"""
57. Мне часто бывает скучно, когда вокруг все веселятся
""",
"""
58. Мое грустное настроение легко исправляется, если я смотрю в кино или по телевизору комедийное представление
""",
"""
59. Ради сохранения добрых отношений я могу отказаться от своих намерений
""",
"""
60. Я всегда придерживаюсь общепринятых правил поведения
""",
"""
61. Меня любят все мои друзья
""",
"""
62. У меня трагичная судьба
""",
"""
63. У меня много близких друзей
""",
"""
64. Я самый несчастный человек на свете
""",
"""
65. Мне проще надеяться на других, чем брать на себя ответственность, даже если речь идет о моих проблемах
""",
"""
66. Я стараюсь быть таким (такой) «как все», не выделяться среди других
""",
"""
67. Я человек спокойный, уравновешенный
""",
"""
68. Я могу долго не реагировать на чьи-то шутки, но потом «взорваться» гневной реакцией
""",
"""
69. Я очень чувствителен (чувствительна) к изменениям погоды
""",
"""
70. Я не люблю присутствовать на шумных застольях
""",
"""
71. Я могу проявить безалаберность в делах, а потом понемногу приводить их в порядок
""",
"""
72. Я люблю ходить в гости
""",
"""
73. Мне все равно, что обо мне думают окружающие
""",
"""
74. Я волнуюсь только по поводу очень больших неприятностей
""",
"""
75. Я никогда не испытываю желания выругаться
""",
"""
76. Я никого никогда не обманывал(а)
""",
"""
77. Мне никто не нужен, и я не нужен (не нужна) никому
""",
"""
78. Я человек застенчивый
""",
"""
79. Мне ужасно не везет в жизни
""",
"""
80. Я часто стараюсь следовать советам более авторитетной личности
""",
"""
81. Я бы очень переживал(а), если бы кого-то задел(а) или обидел(а)
""",
"""
82. Меня ничем не испугать
""",
"""
83. Я часто пользуюсь чужими советами при решении своих проблем
""",
"""
84. В своих неудачах я в первую очередь виню самого (саму) себя
""",
"""
85. Я совершенно не обращаю внимания на свой стиль одежды
""",
"""
86. Я не стараюсь планировать свое ближайшее будущее и работу
""",
"""
87. Когда меня зовут в гости, я чаще всего думаю: «Лучше бы мне остаться дома»
""",
"""
88. Я ничего не знаю о личных проблемах окружающих меня людей
""",
"""
89. Малейшая неудача резко снижает мое настроение
""",
"""
90. Я никогда не сержусь
""",
"""
91. Я отвечал(а) на все вопросы очень правдиво
""",
), 
    'uk': (
"""
1. Я намагатимусь поставитися до дослідження відповідально і бути максимально щирим (щирою)
""",
"""
2. У мене дуже складний і важкий для оточуючих характер
""",
"""
3. Я краще впораюсь з роботою в тиші й на самоті, аніж в присутності багатьох людей чи в галасливому місці
""",
"""
4. Вирішуючи серйозні проблеми, я, як правило, впораюсь без сторонньої допомоги
""",
"""
5. Я дуже рідко починаю розмову першим (першою) з незнайомими людьми
""",
"""
6. Для мене важливо, що подумають інші про мої висловлювання й вчинки
""",
"""
7. Якщо буде потрібно, я знищу всі перепони на шляху до мети
""",
"""
8. Я часто непокоюся через дрібниці
""",
"""
9. В моїх невдачах винні певні люди
""",
"""
10. Для мене важливо мати спільну думку з тими людьми, з якими я зазвичай спілкуюся
""",
"""
11. Мене мало стосується все, що трапляється з іншими
""",
"""
12. Мене цікавлять яскраві, артистичні особистості
""",
"""
13. Мені нема діла до чужих страждань: своїх вистачає
""",
"""
14. В галасливому товаристві я частіше за все в ролі лише спостерігача
""",
"""
15. Мені нестерпно спостерігати за стражданнями інших людей
""",
"""
16. Я людина абсолютно правдива і щира
""",
"""
17. Всі мої біди пов’язані з власним невмінням ладнати з людьми
""",
"""
18. Мене часто тягне до галасливих товариств
""",
"""
19. Ухвалюючи важливе рішення, я завжди дію самостійно
""",
"""
20. Мені завжди приємно заводити нових знайомих
""",
"""
21. Беручись за якусь справу, я не стану довго розмірковувати, перш ніж почати діяти
""",
"""
22. Мене дратують люди, які намагаються змінити мою думку, коли я впевнений (впевнена) у своїй правоті
""",
"""
23. Я часто хвилююся за близьких мені людей без серйозного приводу
""",
"""
24. Я терпіти не можу, коли хтось змінює заведений мною порядок
""",
"""
25. Я вмію привертати до себе увагу оточуючих мене людей
""",
"""
26. В житті я твердо притримуюсь певних принципів
""",
"""
27. Люблю відвідувати товариства, де можна танцювати або співати
""",
"""
28. Я надзвичайно чутливий (чутлива) до змін у настрої оточуючих мене людей
""",
"""
29. Я можу, не бентежачись, дуріти у веселому товаристві
""",
"""
30. Я спокійно ставлюсь до того, що хтось поруч переживає з приводу своїх неприємностей
""",
"""
31. Я ніколи не вчиняю, як егоїст (егоїстка)
""",
"""
32. Часто буває так, що через мене у оточуючих псується настрій
""",
"""
33. Цікаві ідеї приходять мені в голову частіше, коли я один (одна), не в присутності багатьох людей
""",
"""
34. Я можу взяти на себе відповідальність за цілу групу людей заради справи
""",
"""
35. Мені важко подолати сором’язливість, коли потрібно говорити перед групою людей
""",
"""
36. Думка старших за віком чи статусом не має для мене великого значення
""",
"""
37. Мені не важко змусити інших людей діяти так, як я вважаю за потрібне
""",
"""
38. Я так сильно переживаю невдачі, що у мене погіршується самопочуття
""",
"""
39. Я завжди буваю впертим (впертою) у тих випадках, коли впевнений (впевнена) у своїй правоті
""",
"""
40. Якщо в товаристві я не знаходжуся у центрі уваги, мені стає нудно і не цікаво
""",
"""
41. Ніхто не може нав’язати мені свою думку
""",
"""
42. Мені подобається мандрувати з різними, кожного разу новими попутниками
""",
"""
43. Я можу змінити свою думку під тиском оточуючих
""",
"""
44. В потягу я із задоволенням проводжу час у бесіді із сусідами по купе
""",
"""
45. Я ніколи не брешу
""",
"""
46. Я ніколи не відкладаю на завтра те, що треба зробити сьогодні
""",
"""
47. Я вічно чимось незадоволений (незадоволена)
""",
"""
48. Я люблю самоту, що дозволяє мені зосередитися на своїх думках
""",
"""
49. Я вмію зацікавити людей і повести їх за собою
""",
"""
50. Мені подобається командувати іншими
""",
"""
51. Я вмію давати відсіч тим, хто втручається у мої справи
""",
"""
52. Мені буває ніяково за висловлювання й вчинки моїх близьких
""",
"""
53. Мені часто доводилося в бійці захищати свої права
""",
"""
54. Я відчуваю провину (чи навіть сором), якщо мене переслідують невдачі
""",
"""
55. Мій настрій знаходиться в сильній залежності від настрою тих, хто мене оточує
""",
"""
56. Я домагаюся свого завзятістю й наполегливістю
""",
"""
57. Мені часто буває нудно, коли навкруги всі веселяться
""",
"""
58. Мій сумний настрій легко виправляється, якщо я дивлюся в кіно чи по телевізору комедійну виставу
""",
"""
59. Заради збереження добрих стосунків я можу відмовитися від своїх намірів
""",
"""
60. Я завжди притримуюся загальноприйнятих правил поведінки
""",
"""
61. Мене люблять всі мої друзі
""",
"""
62. У мене трагічна доля
""",
"""
63. У мене багато близьких друзів
""",
"""
64. Я найбільш нещасна людина на світі
""",
"""
65. Мені простіше сподіватися на інших, ніж брати на себе відповідальність, навіть якщо йдеться про мої проблеми
""",
"""
66. Я стараюся бути таким (такою) «як усі», не виділятися серед інших
""",
"""
67. Я людина спокійна, врівноважена
""",
"""
68. Я можу довго не реагувати на чиїсь жарти, але потім «вибухнути» гнівною реакцією
""",
"""
69. Я дуже чутливий (чутлива) до зміни погоди
""",
"""
70. Я не люблю бути присутнім на галасливих застіллях
""",
"""
71. Я можу проявити недбалість у справах, а потім потроху приводити їх до ладу
""",
"""
72. Я люблю ходити в гості
""",
"""
73. Мені все одно, що про мене думають оточуючі
""",
"""
74. Я хвилююся лише з приводу дуже великих неприємностей
""",
"""
75. Я ніколи не відчуваю бажання вилаятися
""",
"""
76. Я нікого ніколи не обманював (обманювала)
""",
"""
77. Мені ніхто не потрібен, і я нікому не потрібен (не потрібна)
""",
"""
78. Я людина сором’язлива
""",
"""
79. Мені жаливо не щастить у житті
""",
"""
80. Я часто намагаюся дотримуватися порад більш авторитетної особи
""",
"""
81. Я б дуже хвилювався (хвилювалася), якби когось зачепив (зачепила) чи образив (образила)
""",
"""
82. Мене нічим не злякати
""",
"""
83. Я часто користуюся чужими порадами при вирішенні своїх проблем
""",
"""
84. В своїх невдачах я передусім звинувачую самого (саму) себе
""",
"""
85. Я абсолютно не звертаю увагу на свій стиль одягу
""",
"""
86. Я не стараюся планувати своє найближче майбутнє і роботу
""",
"""
87. Коли мене звуть у гості, я найчастіше думаю «Краще б мені лишитися вдома»
""",
"""
88. Я нічого не знаю про особисті проблеми оточуючих мене людей
""",
"""
89. Найменша невдача різко погіршує мій настрій
""",
"""
90. Я ніколи не серджуся
""",
"""
91. Я відповідав (відповідала) на всі запитання дуже правдиво
""",
),
}

_ANSWERS = {
    'ru': [['Да', '%s.%s:1'], ['Нет', '%s.%s:-1']],
    'uk': [['Так', '%s.%s:1'], ['Ні', '%s.%s:-1']],
}

_no_ext_questions = (0, 90,)

_EXT_ANSWERS = {
    'ru': [['Не знаю', '%s.%s:0']],
    'uk': [['Не знаю', '%s.%s:0']],
}

_RESULTS = {
    'ru': {
        'L. Неискренность' : ([16, 31, 45, 46, 60, 61, 75, 76, 90], []),
        'F. Аггравация'    : ([2, 17, 32, 47, 62, 64, 77, 79], [91]),
        '1. Экстраверсия'  : ([12, 27, 29, 42, 44, 72], [14, 57, 87]),
        '2. Спонтанность'  : ([4, 19, 21, 34, 49, 50], [6, 65, 80]),
        '3. Агрессивность' : ([7, 22, 36, 37, 51, 53, 68], [66, 81]),
        '4. Ригидность'    : ([9, 24, 26, 39, 41, 56], [71, 83, 86]),
        '5. Интроверсия'   : ([3, 5, 33, 35, 48, 78], [18, 20, 63]),
        '6. Сензитивность' : ([15, 28, 43, 59, 89], [11, 13, 30, 74]),
        '7. Тревожность'   : ([8, 23, 38, 52, 54, 69, 84], [67, 82]),
        '8. Лабильность'   : ([10, 25, 40, 55, 58], [70, 73, 85, 88]),
    },
    'uk': {
        'L. Нещирість'     : ([16, 31, 45, 46, 60, 61, 75, 76, 90], []),
        'F. Аггравація'    : ([2, 17, 32, 47, 62, 64, 77, 79], [91]),
        '1. Екстраверсія'  : ([12, 27, 29, 42, 44, 72], [14, 57, 87]),
        '2. Спонтанність'  : ([4, 19, 21, 34, 49, 50], [6, 65, 80]),
        '3. Агресивність'  : ([7, 22, 36, 37, 51, 53, 68], [66, 81]),
        '4. Ригідність'    : ([9, 24, 26, 39, 41, 56], [71, 83, 86]),
        '5. Інтроверсія'   : ([3, 5, 33, 35, 48, 78], [18, 20, 63]),
        '6. Сензитивність' : ([15, 28, 43, 59, 89], [11, 13, 30, 74]),
        '7. Тривожність'   : ([8, 23, 38, 52, 54, 69, 84], [67, 82]),
        '8. Лабільність'   : ([10, 25, 40, 55, 58], [70, 73, 85, 88]),
    },
}

_CONCLUSIONS = {
    'ru' : (
        ( 2, 'Гиперэмотивность, плохое самопонимание или неоткровенность при обследовании'), 
        ( 4, 'Клинические проявления не выявлены'), 
        ( 7, 'Акцентуированные черты, умеренная выраженность'), 
        ( 9, 'Эмоциональная напряжённость, затруднённая адаптация, избыточная выраженность'), 
    ),
    'uk' : (
        ( 2, 'Гіперемотивність, погане само розуміння чи нещирість при обстеженні'), 
        ( 4, 'Ви гармонійна особистість'), 
        ( 7, 'Акцентуйовані риси, помірна вираженість'), 
        ( 9, 'Емоційну напруженість, утруднена адаптація, надлишкова вираженість'), 
    ),
}

_WARNINGS = {
    'ru': (
"""
Внимание, предоставленные данные выглядят недостоверными, рекомендуется быть более искренним в ответах или обратиться к специалисту!
""",
), 
    'uk': (
"""
Увага, надані відповіді видаються не надто достовірними; рекомендується бути більш щирим у відповідях або звернутися до фахівця!
""",
),
}

_FINISH = {
    'ru': (
"""
Завершение диалога.
""",
"""
Мы благодарим Вас за Ваши ответы.
Желаем Вам крепкого здоровья, и всего Вам доброго!
""",
), 
    'uk': (
"""
Завершення діалогу.
""",
"""
Ми дякуємо Вам за Ваші відповіді.
Бажаємо Вам міцного здоров'я, і всього Вам доброго!
""",
),
}

_results = {}


def test_name():
    return _TEST_NAME

def total_questions():
    return _QCOUNT

def get_question(i, lang, no_eof=None):
    x = _QUESTIONS[lang][i].strip()
    s = '%s.%s:' % (_TEST_NAME, x[-1] == '.' and x[:-1] or x)
    return no_eof and re.sub(r'\n', ' ', s) or s

def get_finish(storage, name, i, lang, no_eof=None):
    nic = storage.get(name, 'nic', with_decode=True)
    s = '%s%s' % (nic and '%s!\n\n' % nic or _FINISH[lang][0], _FINISH[lang][i].strip())
    return no_eof and re.sub(r'\n', ' ', s) or s

def get_result(storage, name, lang, mode=None):
    global _results

    res = ''
    data = storage.getall(name)
    results = _RESULTS[lang]
    conclusions = _CONCLUSIONS[lang]

    if mode == 1:
        keys = sorted([x for x in results.keys()]) # if x[0].isdigit()
    else:
        keys = sorted([x for x in results.keys() if x[0] in 'LF'])

    cs, px = {}, {}

    for p in keys:
        # p: ключ параметра: LF или 1...8
        x = 0
        for i in range(0, 2):
            # i=0: группа "Да"
            # i=1: группа "Нет"
            # score: баллы за ответ на вопрос
            score = 1
            for n in results[p][i]:
                # n: номер вопроса
                key = ('%s.%s' % (_TEST_NAME, n)).encode()
                v = int(data.get(key, 0))
                x += i == 0 and v > 0 and score or i == 1 and v < 0 and score or 0

        if mode == 1:
            # x: суммарные баллы за вопрос (?название параметра?) -> результат (характеристика) XXX
            _results[p] = [x, NO_KEY]

            px[p] = x
            c = ''
            for i, item in enumerate(conclusions):
                # item: граничное значение параметра
                if x <= item[0]:
                    # c: итоговая оценка по параметру
                    c = item[1]
                    _results[p][1] = c
                    if _with_group:
                        if i not in cs:
                            cs[i] = []
                        cs[i].append(p)
                    break
            # res: текст результата
            if not _with_group:
                res += '%s: [%s] <b>%s</b>\n' % (p, x, c)
        else:
            if x > 5:
                return True

    if mode == 1:
        if _with_group:
            for i in cs:
                res += '<b>%s:</b>\n' % conclusions[i][1]
                for p in cs[i]:
                    res += '    %s: [%s]\n' % (p, px[p])
        return res.strip()

def answer(bot, message, command, data=None, logger=None, question=None, **kw):
    """
        Make the step's answer
    """
    lang = kw.get('lang') or DEFAULT_LANGUAGE
    storage = kw.get('storage')
    name = kw.get('name')

    is_run = True

    if question == _QCOUNT or (IsDebug and question > 0 and question%10 == 0):
        result = get_result(storage, name, lang, mode=1)
        bot.send_message(message.chat.id, result, parse_mode=DEFAULT_PARSE_MODE)
        is_run = question < _QCOUNT

        if is_run:
            time.sleep(3)

    if question > _QCOUNT_EXT and 'query_id' in kw:
        if get_result(storage, name, lang, mode=2) and not storage.get(name, 'warning'):
            text = _WARNINGS[lang][0]

            bot.answer_callback_query(
                kw['query_id'],
                text=text,
                show_alert=True
                )

            storage.set(name, 'warning', 1)
            time.sleep(3)

    if is_run:
        answers = deepcopy(_ANSWERS[lang])
        if _with_extra:
            if question not in _no_ext_questions:
                answers += deepcopy(_EXT_ANSWERS[lang])
        for i, a in enumerate(answers):
            answers[i][1] = answers[i][1] % (_TEST_NAME, question+1)
        send_inline_keyboard(bot, message, answers, get_question(question, lang))

    elif 'query_id' in kw:
        _test_name = test_name()

        dbs.drop_before(_test_name, **kw)
        dbs.save_params(_test_name, _RESULTS, _results, split_param=1, **kw)

        if kw['query_id']:
            bot.answer_callback_query(
                kw['query_id'],
                text=get_finish(storage, name, 1, lang),
                show_alert=True
                )

            time.sleep(3)

        help(bot, message, logger=logger, mode=1, **kw)

## -------------------------- ##

def lines(text):
    for line in text.split('\n'):
        if not line:
            continue
        x = line.split('.')
        n, s = int(x[0].strip()), x[1].strip()
        print('"""\n%s. %s\n""",' % (n, s))

def check(data, key, res):
    s = 0
    for k in data[key].keys():
        #print(k)
        q = k.split('.')[1]
        if not q.isdigit():
            continue
        #print(q)
        v = int(data[key][k])
        for i in range(0, 2):
            if int(q) in res[i]:
                s += i == 0 and v > 0 and 1 or i == 1 and v < 0 and 1 or 0
                break
    return s

def selftest(data, lang, with_print=None):
    key = _TEST_NAME
    results = dict([(k.split('.')[0], _RESULTS[lang][k])  for k in _RESULTS[lang].keys()])

    out = []
    r = {}
    for k in sorted(results.keys()):
        if not k in r:
            r[k] = 0
        x = check(data, key, results[k])
        if with_print:
            print(x)
        r[k] += x

        rp = '%s.R%s' % (key, k)
        if rp in data[key]:
            x = int(data[key].get(rp, '0'))
            if r[k] == x:
                out.append('OK')
            else:
                out.append('Error %s [%s:%s]' % (rp, r[k], x))
        else:
            out.append(NO_RESULTS)

    is_ok, is_error = 1, 0
    for s in out:
        if s.startswith('OK'):
            pass
        elif s.startswith('Error'):
            is_ok = 0
            is_error = 1
            if with_print or IsWithPrintErrors:
                print(key, s)
            break
        else:
            is_ok = 0
            break

    return is_ok and 'OK' or is_error and 'Error' or NO_RESULTS
