# -*- coding: utf-8 -*-

import re
import time
from copy import deepcopy
import random

from config import (
     IsDebug, IsDeepDebug, IsTrace, IsPrintExceptions, IsWithPrintErrors, IsWithGroup, IsWithExtra,
     errorlog, print_to, print_exception,
    )

from app.settings import DEFAULT_LANGUAGE, DEFAULT_PARSE_MODE, NO_RESULTS, NO_KEY, RCODES
from app.dialogs.start import help
from app.handlers import *

from app import dbs

# Группировка результатов
_with_group = 0
# Ответ "Не знаю"
_with_extra = IsWithExtra

# Финальный результат теста
_is_without_conclusions = 0

# ---------------------------------------------
# Тест на исследование самоотношения Пантелеева
# ---------------------------------------------

_TEST_NAME = 'T16'
_QCOUNT = 110
_QCOUNT_EXT = 61

_QUESTIONS = {
    'ru': (
"""
1. Мои слова довольно редко расходятся с делами
""",
"""
2. Случайному человеку я, скорее всего, покажусь человеком приятным
""",
"""
3. К чужим проблемам я всегда отношусь с тем же пониманием, что и к своим
""",
"""
4. У меня нередко возникает чувство, что то, о чём я с собой мысленно разговариваю, мне неприятно
""",
"""
5. Думаю, что все мои знакомые относятся ко мне с симпатией
""",
"""
6. Самое разумное, что может сделать человек в своей жизни, - это не противиться собственной судьбе
""",
"""
7. У меня достаточно способностей и энергии воплотить в жизнь задуманное
""",
"""
8. Если бы я раздвоился, то мне было бы довольно интересно общаться со своим двойником
""",
"""
9. Я не способен причинять душевную боль самым любимым и родным мне людям
""",
"""
10. Я считаю, что не грех иногда пожалеть самого себя
""",
"""
11. Совершив какой-то промах, я часто не могу понять, как же мне могло прийти в голосу, что из задуманного могло получиться что-нибудь хорошее
""",
"""
12. Чаще всего я одобряю свои планы и поступки
""",
"""
13. В моей личности есть, наверное, что-то такое, что способно вызвать у других острую неприязнь
""",
"""
14. Когда я пытаюсь оценить себя, я прежде всего вижу свои недостатки
""",
"""
15. У меня не получается быть для любимого человека интересным длительное время
""",
"""
16. Можно сказать, что я ценю себя достаточно высоко
""",
"""
17. Мой внутренний голос редко подсказывает мне то, с чем бы я в конце концов не согласился
""",
"""
18. Многие мои знакомые не принимают меня так уж всерьёз
""",
"""
19. Бывало, и не раз, что я сам остро ненавидел себя
""",
"""
20. Мне очень мешает недостаток энергии, воли и целеустремлённости
""",
"""
21. В моей жизни возникали такие обстоятельства, когда я шёл на сделку с собственной совестью
""",
"""
22. Иногда я сам себя плохо понимаю
""",
"""
23. Порой мне бывает мучительно больно общаться с самим собой
""",
"""
24. Думаю, что без труда смог бы найти общий язык с любым разумным и знающим человеком
""",
"""
25. Если я и отношусь к кому-нибудь с укоризной, то прежде всего к самому себе
""",
"""
26. Иногда я сомневаюсь, можно ли любить меня по-настоящему
""",
"""
27. Нередко мои споры с самим собой обрываются мыслью, что всё равно выйдет не так, как я решил
""",
"""
28. Моё отношение к самому себе можно назвать дружеским
""",
"""
29. Вряд ли найдутся люди, которым я не по душе
""",
"""
30. Часто я не без издёвки подшучиваю над собой
""",
"""
31. Если бы моё второе «Я» существовало, то для меня это был бы довольно скучный партнёр по общению
""",
"""
32. Мне представляется, что я достаточно сложился как личность, и поэтому не трачу много сил на то, чтобы в чём-то стать другим
""",
"""
33. В целом меня устраивает то, какой я есть
""",
"""
34. К сожалению, слишком многие не разделяют моих взглядов на жизнь
""",
"""
35. Я вполне могу сказать, что уважаю сам себя
""",
"""
36. Я думаю, что имею умного и надёжного советчика в себе самом
""",
"""
37. Сам у себя я довольно часто вызываю чувство раздражения
""",
"""
38. Я часто, но довольно безуспешно пытаюсь в себе что-то изменить
""",
"""
39. Я думаю, что моя личность гораздо интереснее и богаче, чем это может показаться на первый взгляд
""",
"""
40. Мои достоинства вполне перевешивают мои недостатки
""",
"""
41. Я редко остаюсь непонятым в самом важном для меня
""",
"""
42. Думаю, что другие в целом оценивают меня достаточно высоко
""",
"""
43. То, что со мной случается, - это дело моих собственных рук
""",
"""
44. Если я спорю с собой, то всегда уверен, что найду единственно правильное решение
""",
"""
45. Когда со мной случаются неприятности, как правило, я говорю: «И поделом тебе»
""",
"""
46. Я не считаю, что достаточно духовно интересен для того, чтобы быть притягательным для многих людей
""",
"""
47. У меня нередко возникают сомнения: а таков ли я на самом деле, каким себе представляюсь?
""",
"""
48. Я не способен на измену даже в мыслях
""",
"""
49. Чаще всего я думаю о себе с дружеской иронией
""",
"""
50. Мне кажется, что мало кто может подумать обо мне плохо
""",
"""
51. Уверен, что на меня можно положиться в самых ответственных делах
""",
"""
52. Я могу сказать, что в целом я контролирую свою судьбу
""",
"""
53. Я никогда не выдаю понравившиеся мне чужие мысли за свои
""",
"""
54. Каким бы я ни казался окружающим, я-то знаю, что в глубине души я лучше, чем большинство других
""",
"""
55. Я хотел бы оставаться таким, какой я есть
""",
"""
56. Я всегда рад критике в свой адрес, если она обоснованна и справедлива
""",
"""
57. Мне кажется, что если бы таких людей, как я, было больше, то жизнь изменилась бы в лучшую сторону
""",
"""
58. Моё мнение имеет достаточный вес в глазах окружающих
""",
"""
59. Что-то мешает мне понять себя по-настоящему
""",
"""
60. Во мне есть немало такого, что вряд ли вызывает симпатию
""",
"""
61. В сложных обстоятельствах я обычно не жду, пока проблемы разрешатся сами собой
""",
"""
62. Иногда я пытаюсь выдавать себя не за того, кто я есть
""",
"""
63. Быть снисходительным к собственным слабостям – вполне естественно
""",
"""
64. Я убедился, что глубокое проникновение в себя – малоприятное и довольно рискованное занятие
""",
"""
65. Я никогда не раздражаюсь и не злюсь без особых на то причин
""",
"""
66. У меня бывают такие моменты, когда я понимаю, что меня есть за что презирать
""",
"""
67. Я часто чувствую, что мало влияю на то, что со мной происходит
""",
"""
68. Именно богатство и глубина моего внутреннего мира и определяют мою ценность как личности
""",
"""
69. Долгие споры с собой чаще всего оставляют горький осадок в моей душе, чем приносят облегчение
""",
"""
70. Думаю, что общение со мной доставляет людям искреннее удовольствие
""",
"""
71. Если говорить откровенно, иногда я бываю очень неприятен
""",
"""
72. Можно сказать, что я себе нравлюсь
""",
"""
73. Я человек надёжный
""",
"""
74. Осуществление моих желаний мало зависит от везения
""",
"""
75. Моё внутреннее «Я» всегда мне интересно
""",
"""
76. Мне очень просто убедить себя не расстраиваться по пустякам
""",
"""
77. Близким людям свойственно меня недооценивать
""",
"""
78. У меня в жизни нередко бывают минуты, когда я сам себе противен
""",
"""
79. Мне кажется, что я всё-таки не умею злиться на себя по-настоящему
""",
"""
80. Я убедился, что в серьёзных делах на меня лучше не рассчитывать
""",
"""
81. Порой мне кажется, что я какой-то странный
""",
"""
82. Я не склонен пасовать перед трудностями
""",
"""
83. Моё собственное «Я» не представляется мне чем-то достойным глубокого внимания
""",
"""
84. Мне кажется, что, глубоко обдумывая свои внутренние проблемы, я научился гораздо лучше себя понимать
""",
"""
85. Сомневаюсь, что вызываю симпатию у большинства окружающих
""",
"""
86. Мне случалось совершать такие поступки, которым вряд ли можно найти оправдание
""",
"""
87. Где-то в глубине души я считаю себя слабаком
""",
"""
88. Если я искренне и обвиняю себя в чём-то, то, как правило, обличительного запала хватает ненадолго
""",
"""
89. Мой характер, каким бы он ни был, вполне меня устраивает
""",
"""
90. Я вполне представляю себе, что меня ждёт впереди
""",
"""
91. Иногда мне бывает трудно найти общий язык со своим внутренним «Я»
""",
"""
92. Мои мысли о себе по большей части сводятся к обвинениям в собственный адрес
""",
"""
93. Я не хотел бы сильно меняться даже в лучшую сторону, потому что каждое изменение – это потеря какой-то дорогой частицы самого себя
""",
"""
94. В результате моих действий слишком часто получается совсем не то, на что я рассчитывал
""",
"""
95. Вряд ли во мне есть что-то, чего бы я не знал
""",
"""
96. Мне ещё многого не хватает, чтобы с уверенностью сказать себе: «Да, я вполне созрел как личность»
""",
"""
97. Во мне вполне мирно уживаются как мои достоинства, так и мои недостатки
""",
"""
98. Иногда я оказываю «бескорыстную» помощь людям только для того, чтобы лучше выглядеть в собственных глазах
""",
"""
99. Мне слишком часто и безуспешно приходится оправдываться перед самим собой
""",
"""
100. Те, кто меня не любит, просто не знают, какой я человек
""",
"""
101. Убедить себя в чём-то не составляет для меня большого труда
""",
"""
102. Я не испытываю недостатка в близких и понимающих меня людях
""",
"""
103. Мне кажется, что мало кто уважает меня по-настоящему
""",
"""
104. Если не мелочиться, то в целом меня не в чем упрекнуть
""",
"""
105. Я сам создал себя таким, каков я есть
""",
"""
106. Мнение других обо мне вполне совпадает с моим собственным
""",
"""
107. Мне бы очень хотелось во многом себя переделать
""",
"""
108. Ко мне относятся так, как я того заслуживаю
""",
"""
109. Думаю, что моя судьбы сложится всё равно не так, как бы мне хотелось теперь
""",
"""
110. Уверен, что в жизни я на своём месте
""",
), 
    'uk': (
"""
1. Мої слова досить рідко розходяться з ділом
""",
"""
2. Випадковій людині я, швидше за все, здамся людиною приємною
""",
"""
3. До чужих проблем я завжди ставлюся з тим же розумінням, що й до своїх
""",
"""
4. У мене нерідко виникає відчуття, що те, про що я подумки із собою розмовляю, мені неприємно
""",
"""
5. Думаю, що всі мої знайомі ставляться до мене із симпатією
""",
"""
6. Найрозумніше, що може зробити людина у своєму житті, - це не опиратися власній долі
""",
"""
7. У мене достатньо здібностей та енергії, щоб втілити в життя задумане
""",
"""
8. Якби я роздвоївся, то мені було б досить цікаво поспілкуватися зі своїм двійником
""",
"""
9. Я не здатен завдати душевного болю найбільш коханим і рідним мені людям
""",
"""
10. Я вважаю, що не гріх іноді пожаліти самого себе
""",
"""
11. Зробивши якусь помилку, я часто не можу зрозуміти, як же мені могло спати на думку, що із задуманого могло вийти що-небудь добре
""",
"""
12. Найчастіше я схвалюю свої плани та вчинки
""",
"""
13. В моїй особистості є, мабуть, щось таке, що здатне викликати у інших гостру неприязнь
""",
"""
14. Коли я намагаюся оцінити себе, я передусім бачу свої недоліки
""",
"""
15. У мене не виходить бути цікавим для коханої людини впродовж довгого часу
""",
"""
16. Можна казати, що я ціню себе досить високо
""",
"""
17. Мій внутрішній голос рідко підказує мені те, з чим я кінець кінцем не погодився б
""",
"""
18. Багато моїх знайомих не сприймають мене так вже серйозно
""",
"""
19. Бувало, і неодноразово, що я гостро ненавидів самого себе
""",
"""
20. Мені дуже заважає брак енергії, волі й цілеспрямованості
""",
"""
21. В моєму житті виникали такі обставини, коли я йшов на угоду з власним сумлінням
""",
"""
22. Іноді я самого себе погано розумію
""",
"""
23. Часом мені буває вкрай болісно спілкуватися із самим собою
""",
"""
24. Думаю, що без труднощів зміг би знайти спільну мову с будь-якою розумною та знаючою людиною
""",
"""
25. Якщо я і ставлюсь з докором до когось, то передусім до самого себе
""",
"""
26. Іноді я сумніваюсь, чи можна кохати мене по-справжньому
""",
"""
27. Нерідко мої суперечки із самим собою обриваються на думці, що все одно вийде не так, як я вирішив
""",
"""
28. Моє ставлення до самого себе можна назвати дружнім
""",
"""
29. Навряд чи знайдуться люди, яким я не до душі
""",
"""
30. Часто я не без знущання жартую над собою
""",
"""
31. Якби моє друге «Я» існувало, то для мене це був би доволі нудний партнер по спілкуванню
""",
"""
32. Мені здається, що я достатньо сформувався як особистість, і тому не витрачаю багато зусиль на те, аби в чомусь стати іншим
""",
"""
33. В цілому мене влаштовує те, яким я є
""",
"""
34. На жаль, забагато людей не розділяють мої погляди на життя
""",
"""
35. Я цілком можу сказати, що поважаю самого себе
""",
"""
36. Я думаю, що маю розумного і надійного порадника в своїй особі
""",
"""
37. У самого себе я досить часто викликаю почуття роздратування
""",
"""
38. Я часто, але досить безуспішно намагаюся щось змінити в собі
""",
"""
39. Я думаю, що моя особистість набагато цікавіша і багатша, ніж це може видатися на перший погляд
""",
"""
40. Мої переваги цілком переважають мої недоліки
""",
"""
41. Мене рідко не розуміють у найважливішому для мене
""",
"""
42. Думаю, що інші в цілому оцінюють мене досить високо
""",
"""
43. Те, що зі мною трапляється, - це моїх власних рук справа
""",
"""
44. Коли я сперечаюсь із собою, то завжди впевнений, що знайду єдино правильне рішення
""",
"""
45. Коли зі мною трапляються неприємності, як правило, я кажу: «Так тобі і треба»
""",
"""
46. Я не вважаю, що достатньо духовно цікавий для того, щоб бути привабливим для багатьох людей
""",
"""
47. У мене нерідко виникають сумніви: а чи такий я насправді, яким себе уявляю?
""",
"""
48. Я не здатен на зраду навіть в думках
""",
"""
49. Частіше за все я думаю про себе з дружньою іронією
""",
"""
50. Мені здається, що мало хто може подумати про мене погано
""",
"""
51. Впевнений, що на мене можна покластися у найвідповідальніших справах
""",
"""
52. Я можу сказати, що в цілому контролюю свою долю
""",
"""
53. Я ніколи не подаю чужі думки, які мені сподобалися, за свої
""",
"""
54. Яким би я не здавався оточуючим, я-то знаю, що в глибині душі я краще, ніж більшість інших людей
""",
"""
55. Я хотів би залишатися таким, яким я є
""",
"""
56. Я завжди радий критиці на свою адресу, якщо вона обґрунтована і справедлива
""",
"""
57. Мені здається, що якби таких людей, як я, було більше, то життя змінилося б на краще
""",
"""
58. Моя думка має достатню вагу в очах оточуючих
""",
"""
59. Щось заважає мені зрозуміти себе по-справжньому
""",
"""
60. В мені є чимало такого, що навряд чи викликає симпатію
""",
"""
61. У складних обставинах я зазвичай не чекаю, допоки проблеми розв’яжуться самі собою
""",
"""
62. Іноді я намагаюся видавати себе не за того, ким я є
""",
"""
63. Бути поблажливим до власних слабкостей – цілком природно
""",
"""
64. Я переконався, що глибоке проникнення у себе – малоприємне і досить ризикована справа
""",
"""
65. Я ніколи не дратуюся і не серджуся без особливих на те причин
""",
"""
66. У мене бувають такі моменти, коли я розумію, що мене є за що зневажати
""",
"""
67. Я часто відчуваю, що мало впливаю на те, що зі мною відбувається
""",
"""
68. Саме багатство і глибина мого внутрішнього світу і визначають мою цінність як особистості
""",
"""
69. Довгі суперечки із собою частіше за все залишають гіркий осад в моїй душі, аніж приносять полегшення
""",
"""
70. Думаю, що спілкування зі мною приносить людям щире задоволення
""",
"""
71. Якщо казати відверто, іноді я буваю дуже неприємною людиною
""",
"""
72. Можна сказати, що я собі подобаюсь
""",
"""
73. Я людина надійна
""",
"""
74. Здійснення моїх бажань мало залежить від везіння
""",
"""
75. Моє внутрішнє «Я» завжди є цікавим для мене
""",
"""
76. Мені дуже просто переконати себе не засмучуватися через дрібниці
""",
"""
77. Близьким людям властиво мене недооцінювати
""",
"""
78. У мене в житті нерідко бувають хвилини, коли я сам собі огидний
""",
"""
79. Мені здається, що я все-таки не вмію по-справжньому сердитися на себе
""",
"""
80. Я переконався, що в серйозних справах на мене краще не розраховувати
""",
"""
81. Часом мені здається, що я якийсь дивний
""",
"""
82. Я не схильний пасувати перед труднощами
""",
"""
83. Моє власне «Я» не видається мені чимось вартим глибокої уваги
""",
"""
84. Мені здається, що, глибоко обмірковуючи свої внутрішні проблеми, я навчився набагато краще розуміти себе
""",
"""
85. Сумніваюся, що викликаю симпатію у більшості оточуючих
""",
"""
86. Мені траплялося робити такі вчинки, котрим навряд чи можна знайти виправдання
""",
"""
87. Десь у глибині душі я вважаю себе слабаком
""",
"""
88. Якщо я і звинувачую себе щиро у чомусь, то, як правило, викривального запалу вистачає ненадовго
""",
"""
89. Мій характер, яким би він не був, цілком мене влаштовує
""",
"""
90. Я цілком уявляю собі, що чекає на мене попереду
""",
"""
91. Іноді мені буває важко знайти спільну мову зі своїм внутрішнім «Я»
""",
"""
92. Мої думки про себе переважно зводяться до звинувачень на власну адресу
""",
"""
93. Я не хотів би сильно змінюватися навіть в кращу сторону, тому що кожна зміна – це втрата якоїсь дорогої частки самого себе
""",
"""
94. В результаті моїх дій занадто часто виходить зовсім не те, на що я розраховував
""",
"""
95. Навряд чи у мені є щось, чого би я не знав
""",
"""
96. Мені ще багато чого не вистачає, щоб з упевненістю сказати собі: «Так, я цілком дозрів як особистість»
""",
"""
97. У мені цілком мирно уживаються як мої переваги, так і мої недоліки
""",
"""
98. Іноді я надаю «безкорисливу» допомогу людям тільки для того, аби краще виглядати у власних очах
""",
"""
99. Мені занадто часто і безуспішно доводиться виправдовуватися перед самим собою
""",
"""
100. Ті, хто мене не любить, просто не знають, яка я людина
""",
"""
101. Переконати себе в чомусь не складає для мене великої праці
""",
"""
102. Я не відчуваю нестачі в близьких людях і людях, які мене розуміють
""",
"""
103. Мені здається, що мало хто поважає мене по-справжньому
""",
"""
104. Якщо не бути дріб’язковим, то в цілому мені нічого дорікнути
""",
"""
105. Я сам створив себе таким, яким я є
""",
"""
106. Думка інших про мене цілковито співпадає з моєю власною
""",
"""
107. Мені б дуже хотілося багато в чому себе переробити
""",
"""
108. До мене ставляться так, як я того заслуговую
""",
"""
109. Думаю, що моя доля складеться все одно не так, як би мені того хотілося тепер
""",
"""
110. Впевнений, що в житті я на своєму місці
""",
),
}

_ANSWERS = {
    'ru': [['Да', '%s.%s:1'], ['Нет', '%s.%s:-1']],
    'uk': [['Так', '%s.%s:1'], ['Ні', '%s.%s:-1']],
}

_no_ext_questions = ()

_EXT_ANSWERS = {
    'ru': [['Не знаю', '%s.%s:0']],
    'uk': [['Не знаю', '%s.%s:0']],
}

_PARAMS = {
    'ru': {
        '01' : ('Замкнутость',              1, ([1, 3, 9, 48, 53, 56, 65], [21, 62, 86, 98])),
        '02' : ('Самоуверенность',          1, ([7, 24, 30, 35, 36, 51, 52, 58, 61, 73, 82], [20, 80, 103])),
        '03' : ('Саморуководство',          1, ([43, 44, 45, 74, 76, 84, 90, 105, 106, 108, 110], [109])),
        '04' : ('Отражённое самоотношение', 1, ([2, 5, 29, 41, 42, 50, 102], [13, 18, 34, 85])),
        '05' : ('Самоценность',             1, ([8, 16, 39, 54, 57, 68, 70, 75, 100], [15, 26, 31, 46, 83])),
        '06' : ('Самопринятие',             1, ([10, 12, 17, 28, 40, 49, 63, 72, 77, 79, 88, 97], [])),
        '07' : ('Самопривязанность',        1, ([6, 32, 33, 55, 89, 93, 95, 101, 104], [96, 107])),
        '08' : ('Внутренняя конфликтность', 1, ([4, 11, 22, 23, 27, 38, 47, 59, 64, 67, 69, 81, 91, 94, 99], [])),
        '09' : ('Самообвинение',            1, ([14, 19, 25, 37, 60, 66, 71, 78, 87, 92], [])),
    },
    'uk': {
        '01' : ('Замкнутість',              1, ([1, 3, 9, 48, 53, 56, 65], [21, 62, 86, 98])),
        '02' : ('Самовпевненість',          1, ([7, 24, 30, 35, 36, 51, 52, 58, 61, 73, 82], [20, 80, 103])),
        '03' : ('Самокерування',            1, ([43, 44, 45, 74, 76, 84, 90, 105, 106, 108, 110], [109])),
        '04' : ('Відображене самоставлення',1, ([2, 5, 29, 41, 42, 50, 102], [13, 18, 34, 85])),
        '05' : ('Самоцінність',             1, ([8, 16, 39, 54, 57, 68, 70, 75, 100], [15, 26, 31, 46, 83])),
        '06' : ('Сапоприйняття',            1, ([10, 12, 17, 28, 40, 49, 63, 72, 77, 79, 88, 97], [])),
        '07' : ("Самоприв'язаність",        1, ([6, 32, 33, 55, 89, 93, 95, 101, 104], [96, 107])),
        '08' : ('Внутрішня конфліктність',  1, ([4, 11, 22, 23, 27, 38, 47, 59, 64, 67, 69, 81, 91, 94, 99], [])),
        '09' : ('Самозвинувачення',         1, ([14, 19, 25, 37, 60, 66, 71, 78, 87, 92], [])),
    },
}

_RESULTS = {
    'ru' : {
        '01' : [
            (1, "Низкий уровень закрытости"), 
            (8, "Средний уровень закрытости"), 
            (11, "Высокий уровень закрытости"), 
        ],
        '02' : [
            (4, "Низкий уровень самоуверенности"), 
            (11, "Средний уровень самоуверенности"), 
            (14, "Высокий уровень самоуверенности"), 
        ],
        '03' : [
            (3, "Низкий уровень саморуководства"), 
            (8, "Средний уровень саморуководства"), 
            (12, "Высокий уровень саморуководства"), 
        ],
        '04' : [
            (2, "Низкий уровень отражённого самоотношения"), 
            (8, "Средний уровень отражённого самоотношения"), 
            (11, "Высокий уровень отражённого самоотношения"), 
        ],
        '05' : [
            (3, "Низкий уровень самоценности"), 
            (10, "Средний уровень самоценности"), 
            (14, "Высокий уровень самоценности"), 
        ],
        '06' : [
            (4, "Низкий уровень самопринятия"), 
            (9, "Средний уровень самопринятия"), 
            (12, "Высокий уровень самопринятия"), 
            ],
        '07' : [
            (2, "Низкий уровень самопривязанности"), 
            (8, "Средний уровень самопривязанности"), 
            (11, "Высокий уровень самопривязанности"), 
        ],
        '08' : [
            (2, "Низкий уровень внутренней конфликтности"), 
            (12, "Средний уровень внутренней конфликтности"), 
            (15, "Высокий уровень внутренней конфликтности"), 
        ],
        '09' : [
            (2, "Низкий уровень самообвинения"), 
            (8, "Средний уровень самообвинения"), 
            (10, "Высокий уровень самообвинения"), 
        ], 
    },
    'uk' : {
        '01' : [(1, "Низький рівень закритості"), (8, "Середній рівень закритості"), (11, "Високий рівень закритості"), ],
        '02' : [(4, "Низький рівень самовпевненості"), (11, "Середній рівень самовпевненості"), (14, "Високий рівень самовпевненості"), ],
        '03' : [(3, "Низький рівень самокерування"), (8, "Середній рівень самокерування"), (12, "Високий рівень самокерування"), ],
        '04' : [(2, "Низький рівень відображеного самоставлення"), (8, "Середній рівень відображеного самоставлення"), (11, "Високий рівень відображеного самоставлення"), ],
        '05' : [(3, "Низький рівень самоцінності"), (10, "Середній рівень самоцінності"), (14, "Високий рівень самоцінності я"), ],
        '06' : [(4, "Низький рівень самоприйняття"), (9, "Середній рівень самоприйняття"), (12, "Високий рівень самоприйняття"), ],
        '07' : [(2, "Низький рівень самоприв’язаності"), (8, "Середній рівень самоприв’язаності"), (11, "Високий рівень самоприв’язаності"), ],
        '08' : [(2, "Низький рівень внутрішньої конфліктності"), (12, "Середній рівень внутрішньої конфліктності"), (12, "Високий рівень с внутрішньої конфліктності"), ],
        '09' : [(2, "Низький рівень самозвинувачення"), (8, "Середній рівень самозвинувачення"), (10, "Високий рівень самозвинувачення"), ], 
    }
}

_CONCLUSIONS = {
    'ru' : {
        'F1' : ([(0, ''), (0, ''), (0, '')]),
    },
    'uk' : {
        'F1' : ([(0, ''), (0, ''), (0, '')]),
    },
}

_HEADERS = {
    'ru': 
"""
Вам предлагается перечень суждений, характеризующих отношение человека к себе, к своим поступкам и действиям. Внимательно прочитайте каждое суждение и ответьте «да», если вы согласны, и «нет», если не согласны.
""",
    'uk': 
"""
Вам пропонується перелік суджень, що характеризують ставлення людини до себе, до своїх вчинків і дій. Уважно прочитайте кожне судження і дайте відповідь «так», якщо ви згоді, й «ні», якщо не згодні.
""",
}

_WARNINGS = {
    'ru': (
"""
Внимание, предоставленные данные выглядят недостоверными, рекомендуется быть более искренним в ответах или обратиться к специалисту!
""",
), 
    'uk': (
"""
Увага, надані відповіді видаються не надто достовірними; рекомендується бути більш щирим у відповідях або звернутися до фахівця!
""",
),
}

_FINISH = {
    'ru': (
"""
Завершение диалога.
""",
"""
Мы благодарим Вас за Ваши ответы.
Желаем Вам крепкого здоровья, и всего Вам доброго!
""",
), 
    'uk': (
"""
Завершення діалогу.
""",
"""
Ми дякуємо Вам за Ваші відповіді.
Бажаємо Вам міцного здоров'я, і всього Вам доброго!
""",
),
}

_results = {}


def test_name():
    return _TEST_NAME

def total_questions():
    return _QCOUNT

def get_question(i, lang, no_eof=None):
    x = _QUESTIONS[lang][i].strip()
    s = '%s.%s.' % (_TEST_NAME, x[-1] == '.' and x[:-1] or x)
    return no_eof and re.sub(r'\n', ' ', s) or s

def get_finish(storage, name, i, lang, no_eof=None):
    nic = storage.get(name, 'nic', with_decode=True)
    s = '%s%s' % (nic and '%s!\n\n' % nic or _FINISH[lang][0], _FINISH[lang][i].strip())
    return no_eof and re.sub(r'\n', ' ', s) or s

def get_result(storage, name, lang, mode=None):
    global _results

    res = ''

    data = storage.getall(name)
    params = _PARAMS[lang]
    results = _RESULTS[lang]
    conclusions = _CONCLUSIONS[lang]

    if mode == 1:
        keys = sorted([x for x in params.keys() if x[0].isdigit()])
    else:
        keys = sorted([x for x in params.keys() if x[0] in 'LF'])

    cs, px = {}, {}

    for p in keys:
        # p: ключ параметра: LF или 1...8
        x = 0
        for i in range(0, 2):
            # i=0: группа "Да"
            # i=1: группа "Нет"
            # score: баллы за ответ на вопрос
            score = 1
            for n in params[p][2][i]:
                # n: номер вопроса
                key = ('%s.%s' % (_TEST_NAME, n)).encode()
                v = int(data.get(key, 0))
                x += i == 0 and v > 0 and score or i == 1 and v < 0 and score or 0

        # param: наименование параметра
        param = params[p][0]
        # m: множитель параметра
        x = x * params[p][1]

        _results[p] = [x, '...']

        if mode == 1:
            px[p] = x
            c = ''
            for i, item in enumerate(results[p]):
                # item: граничное значение параметра
                if x <= item[0]:
                    # c: итоговая оценка по параметру
                    c = item[1]
                    _results[p][1] = c
                    if _with_group:
                        if i not in cs:
                            cs[i] = []
                        cs[i].append(p)
                    break
            # res: текст результата
            if not _with_group:
                res += '%s. %s: [%s] <b>%s</b>\n' % (p, param, x, c)
        else:
            if x > 5:
                return True

    if mode == 1:
        if _with_group:
            for i in cs:
                res += '<b>%s:</b>\n' % results[i][1]
                for p in cs[i]:
                    res += '    %s. %s: [%s]\n' % (p, params[p][0], px[p])
        return res.strip()

def answer(bot, message, command, data=None, logger=None, question=None, **kw):
    """
        Make the step's answer
    """
    lang = kw.get('lang') or DEFAULT_LANGUAGE
    storage = kw.get('storage')
    name = kw.get('name')

    is_run = True

    if question == _QCOUNT or (IsDebug and question > 0 and question%10 == 0):
        result = get_result(storage, name, lang, mode=1)
        bot.send_message(message.chat.id, result, parse_mode=DEFAULT_PARSE_MODE)
        is_run = question < _QCOUNT

        if is_run:
            time.sleep(3)

    if question > _QCOUNT_EXT and 'query_id' in kw:
        if get_result(storage, name, lang, mode=2) and not storage.get(name, 'warning'):
            text = _WARNINGS[lang][0]

            bot.answer_callback_query(
                kw['query_id'],
                text=text,
                show_alert=True
                )

            storage.set(name, 'warning', 1)
            time.sleep(3)

    if is_run:
        answers = deepcopy(_ANSWERS[lang])
        if _with_extra:
            if question not in _no_ext_questions:
                answers += deepcopy(_EXT_ANSWERS[lang])
        for i, a in enumerate(answers):
            answers[i][1] = answers[i][1] % (_TEST_NAME, question+1)
        send_inline_keyboard(bot, message, answers, get_question(question, lang))

    elif 'query_id' in kw:
        _test_name = test_name()

        dbs.drop_before(_test_name, **kw)
        dbs.save_params(_test_name, _PARAMS, _results, **kw)

        if not _is_without_conclusions:
            dbs.save_conclusions(_test_name, _CONCLUSIONS, _results, **kw)
        """
        for p in sorted([x for x in _PARAMS[lang].keys()]):
            if p in _results:
                param = _PARAMS[lang][p][0]
                value, s1 = _results[p]
                storage.set(name, '%s.RP%s' % (_TEST_NAME, p), value)
                storage.set(name, '%s.TP%s' % (_TEST_NAME, p), '<i>%s</i>. %s:%s' % (param, s1, value), with_encode=True)

        if not _is_without_conclusions: 
            conclusions = _CONCLUSIONS[lang]
            for p in sorted(list(conclusions.keys())):
                if p in _results:
                    param = conclusions[p][0]
                    value, s1 = _results[p]
                    storage.set(name, k1:='%s.RC%s' % (_TEST_NAME, p), value)
                    storage.set(name, k2:='%s.TC%s' % (_TEST_NAME, p), v2:='<i>%s</i>. %s:%s' % (param, s1, value), with_encode=True)
                    #print(k1, k2, v2)
        """
        if kw['query_id']:
            bot.answer_callback_query(
                kw['query_id'],
                text=get_finish(storage, name, 1, lang),
                show_alert=True
                )

            time.sleep(3)

        help(bot, message, logger=logger, mode=1, **kw)

## -------------------------- ##

def lines(text):
    for line in text.split('\n'):
        if not line:
            continue
        x = line.split('.')
        n, s = int(x[0].strip()), x[1].strip()
        print('"""\n%s. %s\n""",' % (n, s))

def results(text, is_debug=0):
    """
        '01' : [(1, ''), (8, ''), (11, ''),],
    """
    templates = ("%s'%02d' : [%s],", "(%s, \"%s\"), ")
    splitters = {'p' : ':', 'r' : chr(8211), 'b' : 'бал', 's' : '-'} #–
    p, items, res, n = '', [], [], 0

    for i, line in enumerate(text.split('\n')):
        if is_debug:
            print(line)
        if not line or len(line) == 0:
            continue
        s = line.strip()
        if len(s) == 0:
            continue
        if s.endswith(splitters['p']):
            if p:
                res.append(templates[0] % (' '*8, n, ''.join(items)))
                items = []
                p = ''
                if is_debug:
                    print('>>> param added')
            n += 1
            p = s[:-1]
            if is_debug:
                print('>>> new param:%s (%s)' % (n, p))
        elif splitters['r'] not in s:
            print(">>> param:%s (%s) no 'r' splitter in line %s" % (n, p, i))
        elif splitters['b'] not in s:
            print(">>> param:%s (%s) no 'b' splitter in line %s" % (n, p, i))
        else:
            try:
                caption = s.split(splitters['r'])[1]
                score = s.split(splitters['b'])[0]
                items.append(templates[1] % (
                    int(score.strip().split(splitters['s'])[1]),
                    re.sub(r'[\«\»]', '' , caption.strip()),
                    ))
            except:
                print(">>> param:%s (%s) raise" % (n, p))
                raise

    if p:
        res.append(templates[0] % (' '*8, n, ''.join(items)))

    print('-'*3)
    for r in filter(lambda x: len(x.strip()) > 0, res):
        print(r)

def check(data, key, res):
    s = 0
    for k in data[key].keys():
        #print(k)
        q = k.split('.')[1]
        if not q.isdigit():
            continue
        #print(q)
        v = int(data[key][k])
        for i in range(0, 2):
            if int(q) in res[i]:
                s += i == 0 and v > 0 and 1 or i == 1 and v < 0 and 1 or 0
                break
    return s

def selftest(data, lang, with_print=None):
    key = _TEST_NAME
    params = dict([(k.split('.')[0], _PARAMS[lang][k]) for k in _PARAMS[lang].keys()])

    out = []
    r = {}
    for k in sorted(params.keys()):
        if not k in r:
            r[k] = 0
        x = check(data, key, params[k][2])
        if with_print:
            print(x)

        r[k] += x * params[k][1]

        rp = '%s.R%s' % (key, k)
        if rp in data[key]:
            x = int(data[key].get(rp, '0'))
            if r[k] == x:
                out.append('OK')
            else:
                out.append('Error %s [%s:%s]' % (rp, r[k], x))
        else:
            out.append(NO_RESULTS)

    is_ok, is_error = 1, 0
    for s in out:
        if s.startswith('OK'):
            pass
        elif s.startswith('Error'):
            is_ok = 0
            is_error = 1
            if with_print or IsWithPrintErrors:
                print(key, s)
            break
        else:
            is_ok = 0
            break

    return is_ok and 'OK' or is_error and 'Error' or NO_RESULTS
